do $$
    declare
begin
    call add_new_employee('Ростислав', 'Алексеевич', 'Сазонов', 'Менеджер торгового зала', null, 1);
    call add_new_employee('Егор', 'Петрович', 'Гуляев', 'Консультант', 1, 1);
    call add_new_employee('Виктор', 'Иннокентьевич', 'Большаков', 'Администратор магазина', null, 2);
    call add_new_employee('Александр', 'Святославович', 'Беляков', 'Продавец-консультант', 2, 2);
    call add_new_employee('Вячеслав', 'Владиславович', 'Кузьмин', 'Кассир', 2, 2);
end
$$ language plpgsql;
